{
    "projects": [
        {
            "id": 1,
            "title": "Eva DB Hospital Manager",
            "desc": "Thesis project developed in collaboration with Eva Perón Hospital. Comprehensive patient management system for intensive care unit featuring user authentication, medical records administration, patient management, and internal system communication. Implements custom MVC architecture with PHP templating system, optimized query models, and REST API for frontend-backend communication.",
            "embed": "https://www.youtube.com/embed/oQnkd0SiIy0?si=GbItZ3mB8qSwcAhs",
            "tags": [
                "PHP", "MySQL", "JavaScript", "HTML", "CSS"
            ]
        },
        {
            "id": 2,
            "title": "X-Clone",
            "desc": "My first Laravel project, clone of the famous social-media app X, previously known as Twitter. Made purely using the Laravel TALL stack.",
            "embed": "https://www.youtube.com/embed/zob9BQmir34",
            "tags": [
                "Laravel", "Livewire", "Alpine JS", "Tailwind CSS", "Blade", "MySQL"
            ]
        },
        {
            "id": 3,
            "title": "Task Manager",
            "desc": "Inspired from kanban applications like Trello, I created this app to adquiere knowledge in the field of real-time data and team management.",
            "embed": "https://www.youtube.com/embed/gB3sObcR4_Q?si=1R0j9Sxwung9TDCn",
            "tags": [
                "Laravel", "React", "Tailwind CSS", "API Tokens", "MySQL"
            ]
        },
        {
            "id": 4,
            "title": "Profile Picture Uploader",
            "desc": "Simple but strong application made to upload an image as your profile picture which then can be used or downloaded by other users. It's perhaps my most complete application yet. Includes Backend API in Laravel and Frontend in React. Implements Google OAuth, Sanctum Authentication with API tokens, Email sending, Query Caching with TanStack (React Query), Cloud Storage, and so on.",
            "tags": [
                "Laravel", "React", "Tailwind CSS", "Google OAuth", "API Tokens", "Cloud Storage", "React Query", "MySQL"
            ]
        },
        {
            "id": 5,
            "title": "Personal Portfolio",
            "desc": "A simple landing page built with React JS to showcase who I am, my skills, and my other projects.",
            "tags": [
                "React", "Tailwind CSS"
            ]
        }
    ]
}